Hybrid-Memcached-(with-aggre)/ex5_result/memtier_4t_16t_default_datasize_98_cycle_100_result
16        Threads
50        Connections per thread
120       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        21026.76          ---          ---        37.68226        37.88700        46.59100        76.28700      2854.22 
Gets           19.84        19.84         0.00        36.49602        37.11900        46.07900        75.26300         3.10 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      21046.60        19.84         0.00        37.68114        37.88700        46.59100        76.28700      2857.32 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.519        0.000
SET      33.791        5.000
SET      35.071       10.000
SET      35.583       15.000
SET      36.095       20.000
SET      36.607       25.000
SET      36.863       30.000
SET      37.375       35.000
SET      37.375       40.000
SET      37.631       45.000
SET      37.887       50.000
SET      37.887       52.500
SET      37.887       55.000
SET      38.143       57.500
SET      38.143       60.000
SET      38.143       62.500
SET      38.399       65.000
SET      38.399       67.500
SET      38.655       70.000
SET      38.655       72.500
SET      38.655       75.000
SET      38.911       76.250
SET      38.911       77.500
SET      38.911       78.750
SET      39.167       80.000
SET      39.167       81.250
SET      39.423       82.500
SET      39.423       83.750
SET      39.679       85.000
SET      39.679       86.250
SET      39.935       87.500
SET      39.935       88.125
SET      40.191       88.750
SET      40.191       89.375
SET      40.447       90.000
SET      40.703       90.625
SET      40.703       91.250
SET      40.959       91.875
SET      41.215       92.500
SET      41.471       93.125
SET      41.727       93.750
SET      41.727       94.062
SET      41.983       94.375
SET      41.983       94.688
SET      42.239       95.000
SET      42.239       95.312
SET      42.495       95.625
SET      42.751       95.938
SET      42.751       96.250
SET      43.007       96.562
SET      43.263       96.875
SET      43.519       97.031
SET      43.519       97.188
SET      43.775       97.344
SET      44.031       97.500
SET      44.031       97.656
SET      44.287       97.812
SET      44.543       97.969
SET      44.799       98.125
SET      45.055       98.281
SET      45.311       98.438
SET      45.311       98.516
SET      45.567       98.594
SET      45.567       98.672
SET      45.823       98.750
SET      46.079       98.828
SET      46.335       98.906
SET      46.591       98.984
SET      46.847       99.062
SET      47.103       99.141
SET      47.359       99.219
SET      47.615       99.258
SET      47.871       99.297
SET      48.383       99.336
SET      48.895       99.375
SET      49.663       99.414
SET      51.455       99.453
SET      56.831       99.492
SET      61.695       99.531
SET      64.255       99.570
SET      66.559       99.609
SET      67.071       99.629
SET      68.095       99.648
SET      68.607       99.668
SET      69.631       99.688
SET      70.143       99.707
SET      70.655       99.727
SET      71.167       99.746
SET      71.679       99.766
SET      72.703       99.785
SET      73.215       99.805
SET      73.727       99.814
SET      74.239       99.824
SET      74.239       99.834
SET      74.751       99.844
SET      74.751       99.854
SET      75.263       99.863
SET      75.263       99.873
SET      75.775       99.883
SET      75.775       99.893
SET      76.287       99.902
SET      76.287       99.907
SET      76.287       99.912
SET      76.799       99.917
SET      76.799       99.922
SET      76.799       99.927
SET      77.311       99.932
SET      77.311       99.937
SET      77.823       99.941
SET      77.823       99.946
SET      78.335       99.951
SET      78.847       99.954
SET      78.847       99.956
SET      79.359       99.958
SET      79.359       99.961
SET      79.871       99.963
SET      79.871       99.966
SET      80.383       99.968
SET      80.383       99.971
SET      80.895       99.973
SET      81.407       99.976
SET      81.919       99.977
SET      81.919       99.978
SET      82.431       99.979
SET      82.943       99.980
SET      83.455       99.982
SET      83.455       99.983
SET      84.479       99.984
SET      84.991       99.985
SET      85.503       99.987
SET      86.527       99.988
SET      87.039       99.988
SET      87.551       99.989
SET      88.575       99.990
SET      90.111       99.990
SET      92.159       99.991
SET     106.495       99.991
SET     139.263       99.992
SET     194.559       99.993
SET     242.687       99.993
SET     305.151       99.994
SET     339.967       99.994
SET     370.687       99.995
SET     405.503       99.995
SET     436.223       99.995
SET     471.039       99.995
SET     509.951       99.996
SET     532.479       99.996
SET     569.343       99.996
SET     606.207       99.997
SET     643.071       99.997
SET     659.455       99.997
SET     679.935       99.997
SET     708.607       99.997
SET     724.991       99.998
SET     745.471       99.998
SET     765.951       99.998
SET     786.431       99.998
SET     806.911       99.998
SET     827.391       99.998
SET     847.871       99.998
SET     851.967       99.999
SET     868.351       99.999
SET     872.447       99.999
SET     892.927       99.999
SET     897.023       99.999
SET     913.407       99.999
SET     917.503       99.999
SET     937.983       99.999
SET     942.079       99.999
SET     962.559       99.999
SET     966.655       99.999
SET     966.655       99.999
SET     966.655       99.999
SET     991.231       99.999
SET     991.231       99.999
SET     995.327       99.999
SET     995.327      100.000
SET    1015.807      100.000
SET    1023.999      100.000
SET    1023.999      100.000
SET    1023.999      100.000
SET    1028.095      100.000
SET    1028.095      100.000
SET    1028.095      100.000
[...]
SET    1032.191      100.000
SET    1032.191      100.000
SET    1032.191      100.000
[...]
SET    1040.383      100.000
SET    1040.383      100.000
SET    1040.383      100.000
[...]
SET    1044.479      100.000
SET    1044.479      100.000
---
GET      24.575        0.000
GET      29.951        5.000
GET      31.487       10.000
GET      33.023       15.000
GET      34.047       20.000
GET      34.815       25.000
GET      35.583       30.000
GET      36.095       35.000
GET      36.607       40.000
GET      36.863       45.000
GET      37.119       50.000
GET      37.119       52.500
GET      37.375       55.000
GET      37.375       57.500
GET      37.631       60.000
GET      37.631       62.500
GET      37.631       65.000
GET      37.887       67.500
GET      37.887       70.000
GET      38.143       72.500
GET      38.143       75.000
GET      38.399       76.250
GET      38.399       77.500
GET      38.399       78.750
GET      38.655       80.000
GET      38.655       81.250
GET      38.655       82.500
GET      38.911       83.750
GET      38.911       85.000
GET      39.167       86.250
GET      39.423       87.500
GET      39.423       88.125
GET      39.423       88.750
GET      39.679       89.375
GET      39.679       90.000
GET      39.935       90.625
GET      40.191       91.250
GET      40.191       91.875
GET      40.447       92.500
GET      40.703       93.125
GET      40.959       93.750
GET      41.215       94.062
GET      41.215       94.375
GET      41.471       94.688
GET      41.471       95.000
GET      41.727       95.312
GET      41.727       95.625
GET      41.983       95.938
GET      42.239       96.250
GET      42.495       96.562
GET      42.751       96.875
GET      43.007       97.031
GET      43.007       97.188
GET      43.263       97.344
GET      43.263       97.500
GET      43.519       97.656
GET      43.519       97.812
GET      44.031       97.969
GET      44.031       98.125
GET      44.287       98.281
GET      44.543       98.438
GET      44.543       98.516
GET      44.799       98.594
GET      45.055       98.672
GET      45.311       98.750
GET      45.567       98.828
GET      45.823       98.906
GET      46.079       98.984
GET      46.335       99.062
GET      46.847       99.141
GET      47.615       99.219
GET      47.615       99.258
GET      48.127       99.297
GET      49.407       99.336
GET      55.551       99.375
GET      55.551       99.414
GET      55.551       99.453
GET      63.231       99.492
GET      65.023       99.531
GET      65.279       99.570
GET      66.047       99.609
GET      68.095       99.629
GET      68.095       99.648
GET      68.095       99.668
GET      68.095       99.688
GET      68.095       99.707
GET      68.095       99.727
GET      68.095       99.746
GET      69.119       99.766
GET      69.119       99.785
GET      69.631       99.805
GET      69.631       99.814
GET      69.631       99.824
GET      69.631       99.834
GET      69.631       99.844
GET      69.631       99.854
GET      69.631       99.863
GET      69.631       99.873
GET      75.263       99.883
GET      75.263       99.893
GET      75.263       99.902
GET      75.263       99.907
GET      75.263       99.912
GET      75.775       99.917
GET      75.775       99.922
GET      75.775       99.927
GET      75.775       99.932
GET      75.775       99.937
GET      75.775       99.941
GET      75.775       99.946
GET      75.775       99.951
GET      75.775       99.954
GET      75.775       99.956
GET      81.407       99.958
GET      81.407      100.000
---
WAIT      0.000      100.000